LES/Interfluo/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
                             
                     
scale   1;

vertices
(
	// face 1
	(-2.0 2.00 -3) //0
	(-2.0 0.10 -3) //1
	(-2.0 -0.1 -3) //2
	(-2.0 -2.0 -3) //3
	(-0.1 -2.0 -3) //4
	(0.10 -2.0 -3) //5
	(10.00 -2.0 -3) //6
	(10.00 -0.1 -3) //7
	(10.00 0.10 -3) //8
	(10.00 2.00 -3) //9
	(0.10 2.00 -3) //10
	(-0.1 2.00 -3) //11
	(-0.1 0.10 -3) //12
	(-0.1 -0.1 -3) //13
	(0.10 -0.1 -3) //14
	(0.10 0.10 -3) //15

	// face 2
	(-2.0 2.00 3.) //16
	(-2.0 0.10 3.) //17
	(-2.0 -0.1 3.) //18
	(-2.0 -2.0 3.) //19
	(-0.1 -2.0 3.) //20
	(0.10 -2.0 3.) //21
	(10.00 -2.0 3.) //22
	(10.00 -0.1 3.) //23
	(10.00 0.10 3.) //24
	(10.00 2.00 3.) //25
	(0.10 2.00 3.) //26
	(-0.1 2.00 3.) //27
	(-0.1 0.10 3.) //28
	(-0.1 -0.1 3.) //29
	(0.10 -0.1 3.) //30
	(0.10 0.10 3.) //31
);

//6:6:12

blocks
(
	hex (0 1 12 11 16 17 28 27) (19 19 60) simpleGrading (1 1 1)   //1
	hex (1 2 13 12 17 18 29 28) (2 19 60) simpleGrading (1 1 1)    //2
	hex (2 3 4 13 18 19 20 29) (19 19 60) simpleGrading (1 1 1)    //3
	hex (13 4 5 14 29 20 21 30) (19 2 60) simpleGrading (1 1 1)    //4
	hex (14 5 6 7 30 21 22 23) (19 99 60) simpleGrading (1 1 1)    //5
	hex (15 14 7 8 31 30 23 24) (2 99 60) simpleGrading (1 1 1)    //6
	hex (10 15 8 9 26 31 24 25) (19 99 60) simpleGrading (1 1 1)   //7
	hex (11 12 15 10 27 28 31 26) (19 2 60) simpleGrading (1 1 1)  //8
	hex (12 13 14 15 28 29 30 31) (2 2 60) simpleGrading (1 1 1)   //9
);

edges
(
);

boundary
(

	inlet1
		{
			type patch;
			faces
				(
					(12 13 14 15)
				);
		}
		
	inlet2
		{
			type patch;
			faces
				(
					(0 1 12 11)
					(1 2 13 12)
					(2 3 4 13)
					(13 4 5 14)
					(14 5 6 7)
					(15 14 7 8)
					(10 15 8 9)
					(11 12 15 10)
				);
		}

	inlet3
		{
			type patch;
			faces
				(
					(0 1 17 16)
					(1 2 18 17)
					(2 3 19 18)

				);
		}

		
	outlet
		{
			type patch;
			faces
				(
					(16 17 28 27)
					(17 18 29 28)
					(18 19 20 29)
					(29 20 21 30)
					(30 21 22 23)
					(31 30 23 24)
					(26 31 24 25)
					(27 28 31 26)
					(28 29 30 31)
					(0 11 27 16)
					(11 10 26 27)
					(10 9 25 26)					
					(3 4 20 19)
					(4 5 21 20)
					(5 6 22 21)
					(6 7 23 22)
					(7 8 24 23)
					(8 9 25 24)
				);
		}
);

mergePatchPairs
(
);

// ************************************************************************* //
